#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/yushin-private/aws-mlops/runs/run-9nGRjJ4a6hD4rYhD

Waiting for the plan to start...

Terraform v1.0.5
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
random_string.suffix: Refreshing state... [id=PvJaEFg9]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-075b2168a8a54d959]
module.eks.aws_iam_policy.cluster_elb_sl_role_creation[0]: Refreshing state... [id=arn:aws:iam::112227029085:policy/mlops-eks-elb-sl-role-creation20210824020808104000000002]
module.eks.aws_iam_role.cluster[0]: Refreshing state... [id=mlops-eks20210824020807836000000001]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSServicePolicy[0]: Refreshing state... [id=mlops-eks20210824020807836000000001-20210824020808309600000005]
module.eks.aws_iam_role_policy_attachment.cluster_elb_sl_role_creation[0]: Refreshing state... [id=mlops-eks20210824020807836000000001-20210824020808509500000006]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSClusterPolicy[0]: Refreshing state... [id=mlops-eks20210824020807836000000001-20210824020808291300000004]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSVPCResourceControllerPolicy[0]: Refreshing state... [id=mlops-eks20210824020807836000000001-20210824020808271700000003]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0b18743b4b7302c8f]
aws_security_group.worker_group_mgmt_one: Refreshing state... [id=sg-00a9df337c017e67f]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-06dff361d9daa34ea]
module.eks.aws_security_group.workers[0]: Refreshing state... [id=sg-0d0307e16b9073558]
aws_security_group.worker_group_mgmt_two: Refreshing state... [id=sg-081c66a871fd32313]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-02b7b75b8875b6f02]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0a134ea213c4bf0e2]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-02d825833703ae3e8]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0aff3cd4393d112eb]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-073345847327cab44]
module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-0959be01b385f8ab0]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-00dd6ad17f28e0110]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0374fd609632adf7d]
aws_security_group.all_worker_mgmt: Refreshing state... [id=sg-034198ad97290fcd6]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-06028b53eb644fe96]
module.eks.aws_security_group_rule.workers_ingress_self[0]: Refreshing state... [id=sgrule-3917066488]
module.eks.aws_security_group_rule.workers_egress_internet[0]: Refreshing state... [id=sgrule-1251082616]
module.eks.aws_security_group_rule.cluster_egress_internet[0]: Refreshing state... [id=sgrule-1926091329]
module.eks.aws_security_group_rule.workers_ingress_cluster[0]: Refreshing state... [id=sgrule-599376673]
module.eks.aws_security_group_rule.cluster_https_worker_ingress[0]: Refreshing state... [id=sgrule-561204012]
module.eks.aws_security_group_rule.workers_ingress_cluster_https[0]: Refreshing state... [id=sgrule-3847001575]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-029613a7fdccb2696]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-02d825833703ae3e81080289494]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0ba0c71fe59a51981]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-051a53cf34f3bab1d]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-05b5a62b36b141900]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-08033d4efa6dd5d4d]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-07bcd2960e6d0ee52]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-04417febfdd4b1957]
module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=mlops-eks]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-06028b53eb644fe961080289494]
module.eks.aws_iam_role.workers[0]: Refreshing state... [id=mlops-eks20210824021922484200000009]
module.eks.local_file.kubeconfig[0]: Refreshing state... [id=e15d63c247d7a52a2f70afe97cf76e25db9bcf02]
module.eks.aws_iam_role_policy_attachment.workers_AmazonEKSWorkerNodePolicy[0]: Refreshing state... [id=mlops-eks20210824021922484200000009-2021082402192299810000000c]
module.eks.aws_iam_role_policy_attachment.workers_AmazonEC2ContainerRegistryReadOnly[0]: Refreshing state... [id=mlops-eks20210824021922484200000009-2021082402192299960000000d]
module.eks.aws_iam_role_policy_attachment.workers_AmazonEKS_CNI_Policy[0]: Refreshing state... [id=mlops-eks20210824021922484200000009-2021082402192300010000000e]
module.eks.aws_iam_instance_profile.workers[0]: Refreshing state... [id=mlops-eks2021082402192288320000000a]
module.eks.aws_iam_instance_profile.workers[1]: Refreshing state... [id=mlops-eks2021082402192289060000000b]
module.eks.aws_launch_configuration.workers[0]: Refreshing state... [id=mlops-eks-worker-group-120210824021923324500000010]
module.eks.aws_launch_configuration.workers[1]: Refreshing state... [id=mlops-eks-worker-group-22021082402192332450000000f]
module.eks.aws_autoscaling_group.workers[0]: Refreshing state... [id=mlops-eks-worker-group-120210824021938282500000011]
module.eks.aws_autoscaling_group.workers[1]: Refreshing state... [id=mlops-eks-worker-group-220210824021938292400000012]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.eks.local_file.kubeconfig[0] has been deleted
  - resource "local_file" "kubeconfig" {
      - content              = <<-EOT
            apiVersion: v1
            preferences: {}
            kind: Config
            
            clusters:
            - cluster:
                server: https://0F5C250AF28638C8C818D1C9031677F6.gr7.ap-southeast-2.eks.amazonaws.com
                certificate-authority-data: LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUM1ekNDQWMrZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJeE1EZ3lOREF5TVRRMU5Wb1hEVE14TURneU1qQXlNVFExTlZvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBTUJYCi95eGczN2NwVWo4SE0wSFhyV3ZvSXh5bTRWMmlIaXBRWkpYRDdKV0hyUzdpdGtiTHppZnBCOXE2MXRreHg2SXgKb1JaeHhSaXZKWlBReWl5R3A4TlBYVHZQL2Rxc1lTdjZRZUlQRFY3cnhzZWlDNVZvU0dJRzZIYklSTDFENnJXWgozSmZJNnhnVFZDN0tOZDhnandNS05mcjREb3ZUVjRvLzZnaWtsTyt0aHRtWER0MlVUYzdvNzJZU3RaK3VoWFF4ClhrRWIxUGlGcW0zd0duS3IvaHNYNzRVSnRJL3dya0N3RnI4cW9QR1NwaUhrN01jV05kT1VSZXRPY2NZUlI4aFEKVHR2eG53c3BhL1hBdU9qcWZWNzIrSEVYMytSSFVhY0hMU3Q0TjFOOUpwZzlzcDVTVHdnclNyWDNibDJqUDhFVQo0SVFYdzNzbTFwNFVCNjRsaGhVQ0F3RUFBYU5DTUVBd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0hRWURWUjBPQkJZRUZBazNVV0szTVRHbmFvd2J2RTNuOHUrbXRDMzBNQTBHQ1NxR1NJYjMKRFFFQkN3VUFBNElCQVFDcUNmdkpsN29YQmZ1WFRSeWF1VXFYZmZER1RmYVBrTUc1VFdIcEl4bXNzN1VnSzJJOApxekJSTDlPUGJhcHh2TUNZRFNhKzBrcjlVKytjK3lqS00vYms0RURsajI3NldheXBpb2VhV2NTYTZHMGRWRXQ2Ck1hUWM0anVId1I3RldEbkhnbDhTYTJvOXJIeW8vOXcwY05RYkFwNjhkNFJXTDNQNGhJbE1sV2hCR3ZNWmxZazIKWUtvd3hLUHlPNStiY3NNaXIyMWZHcmUra2laV2U4T05PTk1QeDlSZldyaENZZ1NhV1dwbzlOc2Eybk1NbzFOQQpjemVjeU5HTTJudWdXSGdxWkxUbUYwY25KVzQ3OFRSNkIwLzJVMkp2OTlGVS9uR3hzYWk0OUlFSnNoY0hkVUowCkZwQUtET2txbmlaME9nQVRGWG9JN3MwQjB5QkNpZm8xWC9YNAotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg==
              name: eks_mlops-eks
            
            contexts:
            - context:
                cluster: eks_mlops-eks
                user: eks_mlops-eks
              name: eks_mlops-eks
            
            current-context: eks_mlops-eks
            
            users:
            - name: eks_mlops-eks
              user:
                exec:
                  apiVersion: client.authentication.k8s.io/v1alpha1
                  command: aws-iam-authenticator
                  args:
                    - "token"
                    - "-i"
                    - "mlops-eks"
        EOT -> null
      - directory_permission = "0755" -> null
      - file_permission      = "0600" -> null
      - filename             = "./kubeconfig_mlops-eks" -> null
      - id                   = "e15d63c247d7a52a2f70afe97cf76e25db9bcf02" -> null
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.eks.kubernetes_config_map.aws_auth[0] will be created
  + resource "kubernetes_config_map" "aws_auth" {
      + data = {
          + "mapAccounts" = jsonencode([])
          + "mapRoles"    = <<-EOT
                - "groups":
                  - "system:bootstrappers"
                  - "system:nodes"
                  "rolearn": "arn:aws:iam::112227029085:role/mlops-eks20210824021922484200000009"
                  "username": "system:node:{{EC2PrivateDNSName}}"
            EOT
          + "mapUsers"    = jsonencode([])
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app.kubernetes.io/managed-by" = "Terraform"
              + "terraform.io/module"          = "terraform-aws-modules.eks.aws"
            }
          + name             = "aws-auth"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.eks.local_file.kubeconfig[0] will be created
  + resource "local_file" "kubeconfig" {
      + content              = <<-EOT
            apiVersion: v1
            preferences: {}
            kind: Config
            
            clusters:
            - cluster:
                server: https://0F5C250AF28638C8C818D1C9031677F6.gr7.ap-southeast-2.eks.amazonaws.com
                certificate-authority-data: LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUM1ekNDQWMrZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJeE1EZ3lOREF5TVRRMU5Wb1hEVE14TURneU1qQXlNVFExTlZvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBTUJYCi95eGczN2NwVWo4SE0wSFhyV3ZvSXh5bTRWMmlIaXBRWkpYRDdKV0hyUzdpdGtiTHppZnBCOXE2MXRreHg2SXgKb1JaeHhSaXZKWlBReWl5R3A4TlBYVHZQL2Rxc1lTdjZRZUlQRFY3cnhzZWlDNVZvU0dJRzZIYklSTDFENnJXWgozSmZJNnhnVFZDN0tOZDhnandNS05mcjREb3ZUVjRvLzZnaWtsTyt0aHRtWER0MlVUYzdvNzJZU3RaK3VoWFF4ClhrRWIxUGlGcW0zd0duS3IvaHNYNzRVSnRJL3dya0N3RnI4cW9QR1NwaUhrN01jV05kT1VSZXRPY2NZUlI4aFEKVHR2eG53c3BhL1hBdU9qcWZWNzIrSEVYMytSSFVhY0hMU3Q0TjFOOUpwZzlzcDVTVHdnclNyWDNibDJqUDhFVQo0SVFYdzNzbTFwNFVCNjRsaGhVQ0F3RUFBYU5DTUVBd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0hRWURWUjBPQkJZRUZBazNVV0szTVRHbmFvd2J2RTNuOHUrbXRDMzBNQTBHQ1NxR1NJYjMKRFFFQkN3VUFBNElCQVFDcUNmdkpsN29YQmZ1WFRSeWF1VXFYZmZER1RmYVBrTUc1VFdIcEl4bXNzN1VnSzJJOApxekJSTDlPUGJhcHh2TUNZRFNhKzBrcjlVKytjK3lqS00vYms0RURsajI3NldheXBpb2VhV2NTYTZHMGRWRXQ2Ck1hUWM0anVId1I3RldEbkhnbDhTYTJvOXJIeW8vOXcwY05RYkFwNjhkNFJXTDNQNGhJbE1sV2hCR3ZNWmxZazIKWUtvd3hLUHlPNStiY3NNaXIyMWZHcmUra2laV2U4T05PTk1QeDlSZldyaENZZ1NhV1dwbzlOc2Eybk1NbzFOQQpjemVjeU5HTTJudWdXSGdxWkxUbUYwY25KVzQ3OFRSNkIwLzJVMkp2OTlGVS9uR3hzYWk0OUlFSnNoY0hkVUowCkZwQUtET2txbmlaME9nQVRGWG9JN3MwQjB5QkNpZm8xWC9YNAotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg==
              name: eks_mlops-eks
            
            contexts:
            - context:
                cluster: eks_mlops-eks
                user: eks_mlops-eks
              name: eks_mlops-eks
            
            current-context: eks_mlops-eks
            
            users:
            - name: eks_mlops-eks
              user:
                exec:
                  apiVersion: client.authentication.k8s.io/v1alpha1
                  command: aws-iam-authenticator
                  args:
                    - "token"
                    - "-i"
                    - "mlops-eks"
        EOT
      + directory_permission = "0755"
      + file_permission      = "0600"
      + filename             = "./kubeconfig_mlops-eks"
      + id                   = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ config_map_aws_auth = [
      + {
          + binary_data = null
          + data        = {
              + "mapAccounts" = jsonencode([])
              + "mapRoles"    = <<-EOT
                    - "groups":
                      - "system:bootstrappers"
                      - "system:nodes"
                      "rolearn": "arn:aws:iam::112227029085:role/mlops-eks20210824021922484200000009"
                      "username": "system:node:{{EC2PrivateDNSName}}"
                EOT
              + "mapUsers"    = jsonencode([])
            }
          + id          = (known after apply)
          + metadata    = [
              + {
                  + annotations      = null
                  + generate_name    = null
                  + generation       = (known after apply)
                  + labels           = {
                      + "app.kubernetes.io/managed-by" = "Terraform"
                      + "terraform.io/module"          = "terraform-aws-modules.eks.aws"
                    }
                  + name             = "aws-auth"
                  + namespace        = "kube-system"
                  + resource_version = (known after apply)
                  + uid              = (known after apply)
                },
            ]
        },
    ]

```
</details>
*Pusher: @yushindkang, Action: `pull_request`*